---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.HasCustomData(System.Int32)
source: html/bcbc4385-6b51-4cc7-1588-90a2c0157776.htm
---
# Autodesk.Revit.DB.FabricationPart.HasCustomData Method

Check if fabrication part contains custom data already.

## Syntax (C#)
```csharp
public bool HasCustomData(
	int customId
)
```

## Parameters
- **customId** (`System.Int32`) - The identifier of the custom data field to look for.

## Returns
Returns true if the fabrication part contains the custom data.